tutorials/catalyticZonesReactingFoam/isoOxidativeCouplingMethane/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fixedTemperature
{
    type            fixedTemperatureConstraint;
    active          yes;
    selectionMode   all;

    mode            uniform;
    temperature     constant 1123;
}

//************************************************************************** //

